class All_Text:

    # keyboard text
    keyboard_text_start = "Что вы хотите сделать?"

    # message text
    start_message = f"""

Я ваш помочник с экономическими задачами Аркадий!

Я могу помочать вам решить следующие задачи:
- Построить общую КПВ
- Найти точку рыночного равновесия
- Расчитать объем дефицита/излишка для заданных функций спроса и предложения и уровня цены
- Расчитать прибыль фирмы
"""
    
    second_start_message = "Что вы хотите сделать?"

    # buttons text
    button_graph = 'Построить общую КПВ'
    button_back_to_menu = 'Вернуться на главную'
    button_indev = 'Кнопка еще не готова' 
