class All_Text:

    # keyboard text
    keyboard_text_start = "Что вы хотите сделать?"


    # start text
    start_main_text = """

Я ваш помочник с экономическими задачами Аркадий!

Я могу помочать вам решить следующие задачи:
- Построить общую КПВ
- Найти точку рыночного равновесия
- Расчитать объем дефицита/излишка для заданных функций спроса и предложения и уровня цены
- Расчитать прибыль фирмы
"""
    second_start_main_text = "Что вы хотите сделать?"


    #help text
    help_main_text = """
Возникли вопросы по командам?

Я помогу вам разобраться с ними!

Просто выберите о каком пункте Вы хотите узнать подробней
1 - построение общей КПВ
2 - нахождение точки рыночного равновесия
3 - расчет объема дефицита/излишка
4 - расчет прибыля фирмы
"""
    help_question_text = "Что-нибудь еще?"

    help_point_text = [

        """
Построение графика КПВ.
(КПВ - Кривая Производственных Возможностей)

Тут все просто!

Ты вводишь максимальное количество товаров А и Б для двух производителей.

Я же строю для тебя график, который показиывает общую КПВ для этих товаров.

P.S. Так как я не являюсь мощным вычислительным средством, то лимит на количество товаров будет составлять 10000
Если он будет превышен, то я автоматически снижу количество до максимального значения.
""",

        """
инфа по пункту 2
""",

        """
инфа по пунтку 3
""",

        """
инфа по пункту 4
"""
    ]


    # graph request text
    graph_request = [
        "Введите максимальный объем производства товара А для первого производителя",
        "Введите максимальный объем производства товара Б для первого производителя",
        "Введите максимальный объем производства товара А для второго производителя",
        "Введите максимальный объем производства товара Б для второго производителя"
    ]
    
    # filter answer text
    incorrect_message_text = "Извините, но я не понимаю вас"
    incorrect_data_text = "Простите, но кажется, что Вы ввели неверные данные"
    incorrect_num_text = "Прошу вводить только числа"
    incorrect_negative_num_text = "Прошу вводить положительные числа"

    incorrect_command = """
Хотел бы я поболтать, но нужно заняться делом!
Прошу, выберите, что хотите сделать
"""


    # buttons text
    button_graph = 'Построить общую КПВ.'
    button_back_to_menu = 'Вернуться на главную.'

    button_help_1 = '1'
    button_help_2 = '2'
    button_help_3 = '3'
    button_help_4 = '4'

    button_indev = 'Кнопка еще не готова' 
